app/controllers/challenges_controller.rb

  def host
    @challenges = Challenge.where(user: current_user).order("created_at DESC")
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."user_id" = 2 ORDER BY created_at_DESC

  def index
    @challenges = Challenge.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 8 )
---
SELECT "challenges".* FROM "challenges" ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "challenges"

  def create
    @challenge = Challenge.new(challenge_params)
    #set user id for challenge to current user
    #set this to HOST ID
    #take user id and assign to host if user created=HOST...else user END
    @challenge.user_id = current_user.id
#create migration: host boolean, true


    Stripe.api_key = ENV["STRIPE_API_KEY"]
    token = params[:stripeToken]

    recipient = Stripe::Recipient.create(
      :name => current_user.full_name,
      :type => "individual",
      :bank_account => token
      )

      current_user.recipient = recipient.id
      current_user.save
---
INSERT INTO "challenges" ("created_at", "description", "duration", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "name", "stake", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "recipient" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["recipient", "rp_1041XG4PpT4qw9wWA7OBuJTi"], ["updated_at", Tue, 13 May 2014 00:55:05 UTC +00:00]]

  def update
    respond_to do |format|
      if @challenge.update(challenge_params)
---
UPDATE "challenges" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "challenges"."id" = 4

  def destroy
    @challenge.destroy
---
DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 1]]

    def set_challenge
      @challenge = Challenge.find(params[:id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "2"]]