app/controllers/payments_controller.rb

SELECT "payments".* FROM "payments" WHERE "payments"."host_id" = 3 ORDER BY created_at DESC
---
 def history
    @payments = Payment.all.where(host: current_user).order("created_at DESC")

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "24"]]
---
  def new
    @payment = Payment.new
    @challenge = Challenge.find(params[:challenge_id])

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "23"]]
INSERT INTO "payments" ("address", "city", "created_at", "state", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "123 fake"], ["city", "rosemead"], ["created_at", Fri, 09 May 2014 20:02:28 UTC +00:00], ["state", "ca"], ["updated_at", Fri, 09 May 2014 20:02:28 UTC +00:00]]
---
  def create
    @payment = Payment.new(payment_params)
    #tells you to find the id in the URL
    @challenge = Challenge.find(params[:challenge_id])
    @host = @challenge.user

    @payment.challenge_id = @challenge.id
    #fill in player id when you enter a new player, authenticate above, in purple
    @payment.player_id = current_user.id
    @payment.host_id = @host.id

     Stripe.api_key = ENV["STRIPE_API_KEY"]
    token = params[:stripeToken]

    begin
      charge = Stripe::Charge.create(
        :amount => (@challenge.stake * 100).floor,
        :currency => "usd",
        :card => token
        )

SELECT "payments".* FROM "payments" WHERE "payments"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_payment
      @payment = Payment.find(params[:id])